ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДИПЛОМНЕТОЛОГИЯ/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий    
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Проверка,если выбран договор с типом абонентская плата - что дата документа
		// лежит между датой начала и датой окончания действия договора
		
		Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда  
			
			Если НЕ (Дата > Договор.ВКМ_НачалоДействияДоговора И Дата < Договор.ВКМ_КонецДействияДоговора) Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("Дата документа не попадает в рамки действия выбранного договора");
				Возврат;	
			КонецЕсли; 
			
			// Движение по регистру ВыполненныеКлиентуРаботы   
			
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;   
			
			СтавкаЧаса = Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста;
			КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход(); 
			Движение.Период = Дата;
			Движение.Клиент = Клиент; 
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = КоличествоЧасов; 
			Движение.СуммаКОплате = КоличествоЧасов * СтавкаЧаса;
			
		КонецЕсли;   
		
		
		//Движение по регистру накопления ВыполненныеСотрудникомРаботы
		Отбор = Новый Структура("Сотрудник", Специалист);  
		Попытка
			ПроцентОтВыполненныхРабот = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата,Отбор)[0].ПроцентЗаВыполненныеРаботы;
		Исключение  
			ОбщегоНазначения.СообщитьПользователю("Для текущего специалиста не установлен % за выпол. работы");
		КонецПопытки;
		
		Если ПроцентОтВыполненныхРабот = Null ИЛИ ПроцентОтВыполненныхРабот = Неопределено Тогда   
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
		Если ПроцентОтВыполненныхРабот >= 0 Тогда 
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина; 
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход(); 
			Движение.Период = Дата;
			Движение.Сотрудник = Специалист;
			Движение.ЧасовКОплате = КоличествоЧасов; 
			Движение.СуммаКОплате = КоличествоЧасов * СтавкаЧаса * ПроцентОтВыполненныхРабот/100;
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
		
		ЭтотДокументНовый = ЭтотОбъект.ЭтоНовый();   	
		Если ЭтотДокументНовый ИЛИ ЕстьИзмененияВДокументе() Тогда         			
			СформироватьУведомлениеДляТГ(); 
		КонецЕсли;   
		
	КонецПроцедуры 	
	
	#КонецОбласти  
	
	#Область СлужебныеПроцедурыИФункции
	Функция ЕстьИзмененияВДокументе()
		Результат = Ложь;  
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот ИЛИ
			Выборка.Специалист <> Специалист ИЛИ
			Выборка.Клиент <> Клиент Тогда
			Результат = Истина;
		КонецЕсли;
		
		Возврат Результат;  
		
	КонецФункции
	
	Процедура СформироватьУведомлениеДляТГ()
		НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();	
		ТекстУведомления = СтрШаблон("Специалист: %1 
		|Клиент: %2 
		|Договор: %3 
		|Дата проведения работ: %4 
		|Описание проблемы: %5", Специалист, Клиент, Договор, ДатаПроведенияРабот, ОписаниеПроблемы); 
		
		НовоеУведомление.ТекстСообщения = ТекстУведомления;
		НовоеУведомление.Записать();     
		
	КонецПроцедуры 
	
	#КонецОбласти  
	
#КонецЕсли
